/////////////////////////////////////////////////////////////////////////////
// Прикладное программирование
// Вычисление параксиальных характеристик линзы
// Класс Поверхность
// surface.h
// 
// Ахмаров Руслан
// Университет ИТМО, B34003
/////////////////////////////////////////////////////////////////////////////
// проверка на повторное подключение файла
#if !defined SURFACE_H
#define SURFACE_H 

#include "matrix.h"
using namespace std;
/////////////////////////////////////////////////////////////////////////////
// Описание класса Поверхность
class Surface {
protected:
	double m_h;

public:
	Surface();
	~Surface();

	void SetH(double h);
	double GetH();
	virtual void GetTransformMatrix(Matrix<double>& transform, double n, double n_) = 0;
};
/////////////////////////////////////////////////////////////////////////////
#endif //defined SURFACE_H