// Ћабораторна€ работа є1, вариант є7, группа B34003, студент јхмаров –услан »дрисович

#include <iostream> // стандартный поток консольного ввода/вывода
#include <cmath> // заголовочный файл, содержащий основные математические функции

using namespace std; // используемое стандартное пространство имен

int main()
{
    // объ€вление и инициализаци€ переменных
    double z1 = 0.0, z2 = 0.0, y1 = 0.0, y2 = 0.0;
    double z1_n = 0.0, z1_d = 0.0, y1_n = 0.0, y1_d = 0.0;
    double m = 0.0, n = 0.0, a = 0.0;

    // ввод параметров оператором
    cout << "Enter parameters m, n and a(alpha) divided by space: ";
    cin >> m >> n >> a;
    cout << "\n";

    // вычисление заданных выражений
    z1_n = pow((pow(m, 2) - 1 / (pow(n, 2))), m) * pow((n + 1 / m), n - m); // числитель Z1
    z1_d = pow((pow(n, 2) - 1 / pow(m, 2)), n) * pow((m - 1 / n), m - n); // знаменатель Z1
    z1 = z1_n / z1_d;

    z2 = pow(m / n, m + n);

    y2 = pow(1 / tan(a), 2);

    y1_n = pow(cos(a), 2) - y2 + 1; // числитель Y1
    y1_d = pow(sin(a), 2) + pow(tan(a), 2) - 1; // знаменатель Y1
    y1 = y1_n / y1_d;

    // вывод результатов вычислений
    cout << "Calculation results:\nZ1 = " << z1 << "\nZ2 = " << z2 << "\nY1 = " << y1 << "\nY2 = " << y2;

    cin.get(); // задержка экрана

    return 0;
}
